def sql_query_stationary(sql_cond):
    return f"""
WITH main_query AS (
    SELECT "КСГ",
                           count(*)                                                     as "К-во",
                           ROUND(SUM(CAST("Тариф" AS numeric(10, 2)))::numeric, 2)      as "Сумма",
                           SUM(CASE WHEN "Подразделение" = 'ГП №3' THEN 1 ELSE 0 END)   AS "ГП3",
                           round(SUM(CASE
                                         WHEN "Подразделение" = 'ГП №3'
                                             THEN round(CAST("Сумма" AS numeric(15, 2)):: numeric, 2)
                                         ELSE 0 END):: numeric,
                                 2)                                                     AS "ГП3 Сумма",
                           SUM(CASE
                                   WHEN "Подразделение" = 'ГП №11' and
                                        "Врач" not in ('11136001 Сорокина Татьяна Валентиновна',
                                                       '11136003 Сорокина Татьяна Валентиновна',
                                                       '11136005 Карандеев Максим Анатольевич',
                                                       '11112018 Шадрин Илья Сергеевич',
                                                       '11112021 Асадов Кямран Аюпович',
                                                       '11112022 Малаханова Юлия Максимовна',
                                                       '11136007 Столярова Тамара Владимировна',
                                                       '11136014 Войтко Валерия Александровна') THEN 1
                                   ELSE 0 END)                                          AS "ГП11",
                           round(SUM(CASE
                                         WHEN "Подразделение" = 'ГП №11' and
                                              "Врач" not in ('11136001 Сорокина Татьяна Валентиновна',
                                                             '11136003 Сорокина Татьяна Валентиновна',
                                                             '11136005 Карандеев Максим Анатольевич',
                                                             '11112018 Шадрин Илья Сергеевич',
                                                             '11112021 Асадов Кямран Аюпович',
                                                             '11112022 Малаханова Юлия Максимовна',
                                                             '11136007 Столярова Тамара Владимировна',
                                                             '11136014 Войтко Валерия Александровна')
                                             THEN round(CAST("Сумма" AS numeric(15, 2)):: numeric, 2)
                                         ELSE 0 END):: numeric,
                                 2)                                                     AS "ГП11 Сумма",
                           SUM(CASE
                                   WHEN "Подразделение" = 'ГП №11' and
                                        "Врач" in ('11136001 Сорокина Татьяна Валентиновна',
                                                   '11136003 Сорокина Татьяна Валентиновна',
                                                   '11136005 Карандеев Максим Анатольевич',
                                                   '11112018 Шадрин Илья Сергеевич',
                                                   '11112021 Асадов Кямран Аюпович',
                                                   '11112022 Малаханова Юлия Максимовна') THEN 1
                                   ELSE 0 END)                                          AS "ЦАХ",
                           round(SUM(CASE
                                         WHEN "Подразделение" = 'ГП №11' and
                                              "Врач" in ('11136001 Сорокина Татьяна Валентиновна',
                                                         '11136003 Сорокина Татьяна Валентиновна',
                                                         '11136005 Карандеев Максим Анатольевич',
                                                         '11112018 Шадрин Илья Сергеевич',
                                                         '11112021 Асадов Кямран Аюпович',
                                                         '11112022 Малаханова Юлия Максимовна')
                                             THEN round(CAST("Сумма" AS numeric(15, 2)):: numeric, 2)
                                         ELSE 0 END):: numeric,
                                 2)                                                     AS "ЦАХ Сумма",
                           SUM(CASE
                                   WHEN "Подразделение" = 'ГП №11' and
                                        "Врач" in ('11136007 Столярова Тамара Владимировна',
                                                   '11136014 Войтко Валерия Александровна') THEN 1
                                   ELSE 0 END)                                          AS "ГП11 гин.",
                           round(SUM(CASE
                                         WHEN "Подразделение" = 'ГП №11' and
                                              "Врач" in ('11136007 Столярова Тамара Владимировна',
                                                         '11136014 Войтко Валерия Александровна')
                                             THEN round(CAST("Сумма" AS numeric(15, 2)):: numeric, 2)
                                         ELSE 0 END):: numeric,
                                 2)                                                     AS "ГП11 гин. Сумма",
                           SUM(CASE WHEN "Подразделение" = 'ОАПП №1' THEN 1 ELSE 0 END) AS "ОАПП1",
                           round(SUM(CASE
                                         WHEN "Подразделение" = 'ОАПП №1'
                                             THEN round(CAST("Сумма" AS numeric(15, 2)):: numeric, 2)
                                         ELSE 0 END):: numeric,
                                 2)                                                     AS "ОАПП1 Сумма",
                           SUM(CASE WHEN "Подразделение" = 'ОАПП №2' THEN 1 ELSE 0 END) AS "ОАПП2",
                           round(SUM(CASE
                                         WHEN "Подразделение" = 'ОАПП №2'
                                             THEN round(CAST("Сумма" AS numeric(15, 2)):: numeric, 2)
                                         ELSE 0 END):: numeric,
                                 2)                                                     AS "ОАПП2 Сумма",
                           SUM(CASE WHEN "Подразделение" = 'ДП №1' THEN 1 ELSE 0 END)   AS "ДП1",
                           round(SUM(CASE
                                         WHEN "Подразделение" = 'ДП №1'
                                             THEN round(CAST("Сумма" AS numeric(15, 2)):: numeric, 2)
                                         ELSE 0 END):: numeric,
                                 2)                                                     AS "ДП1 Сумма",
                           SUM(CASE WHEN "Подразделение" = 'ДП №8' THEN 1 ELSE 0 END)   AS "ДП8",
                           round(SUM(CASE
                                         WHEN "Подразделение" = 'ДП №8'
                                             THEN round(CAST("Сумма" AS numeric(15, 2)):: numeric, 2)
                                         ELSE 0 END):: numeric,
                                 2)                                                     AS "ДП8 Сумма"
                   FROM oms.oms_data
    WHERE "Тип талона" = 'Стационар'
      AND "КСГ" <> 'КСГ не найдена'
      AND "Отчетный период выгрузки" IN ({sql_cond})
      AND "Статус" IN :status_list
      AND "Цель" IN :cel_list
      AND "Тариф" != '0'
      and "Код СМО" like '360%'
      AND "Санкции" is null
    GROUP BY "КСГ"
)
SELECT *
FROM main_query
UNION ALL
SELECT 'Итого',
       SUM("К-во"),
       SUM("Сумма"),
       SUM("ГП3"),
       SUM("ГП3 Сумма"),
       SUM("ГП11"),
       SUM("ГП11 Сумма"),
       SUM("ЦАХ"),
       SUM("ЦАХ Сумма"),
       SUM("ГП11 гин."),
       SUM("ГП11 гин. Сумма"),
       SUM("ОАПП1"),
       SUM("ОАПП1 Сумма"),
       SUM("ОАПП2"),
       SUM("ОАПП2 Сумма"),
       SUM("ДП1"),
       SUM("ДП1 Сумма"),
       SUM("ДП8"),
       SUM("ДП8 Сумма")
FROM main_query
"""
